<script setup>
const lines = [
    '5',
    '100',
    '102',
    '101',
    '91',
    '199',
]
const n = Number(lines[0]);
const a = lines.slice(1).map(Number);
const dp = Array(n).fill(1);

// iは現在注目しているa配列の位置
for(let i = 1; i < n; i++) {

    // 注目している要素より前の要素を確認し、増加列かどうかを判定
    for(let j = 0; j < i; j++) {
        if(a[i] > a[j]) {
            dp[i] = Math.max(dp[i], dp[j] + 1);
        }
    }
}

// ループ内で起きていること（増加部分列は実際に作成されていないが、イメージしやすいように）
// i=4の場合は、それまでに求めた増加部分が列あるので、その後ろに追加

// i = 1の場合
// 102 > 100より、増加部分列: [100, 102] -> 2

// i = 2の場合
// 101 > 100より、増加部分列: [100, 101] -> 2
// 101 > 102 ×

// i = 3の場合
// 91 > 100 ×
// 91 > 102 ×
// 91 > 101 ×

// i = 4の場合
// 199 > 100より、増加部分列: [100, 199] -> 2
// 199 > 102より、増加部分列: [100, 102, 199] -> 3
// 199 > 101より、増加部分列: [100, 101, 199] -> 3
// 199 > 91より、増加部分列: [91, 199] -> 2
console.log(Math.max(...dp));

</script>

<template>
    <div/>
 </template>